GigaDevice-GD32-MCU/GD32F527_EVAL_LVGL/Utilites/BSP_Drive/gd32f527b_lcd_eval.c
    for(index = 0; index < current_font->height; index++) {
        for(counter = 0; counter < current_font->width; counter++) {
            if((((c[index] & ((0x80 << ((current_font->width / 12) * 8)) >> counter)) == 0x00) && (current_font->width <= 12)) ||
                    (((c[index] & (0x1 << counter)) == 0x00) && (current_font->width > 12))) {
                /* write the background color */
                *(__IO uint16_t *)(current_framebuffer + (2 * xaddress) + x) = current_backcolor;
            } else {
                /* write the text color */
                *(__IO uint16_t *)(current_framebuffer + (2 * xaddress) + x) = current_textcolor;
            }

            xaddress++;
        }

        xaddress += (LCD_PIXEL_WIDTH - current_font->width);
    }
}

/*!
    \brief      draw the vertical character on LCD
    \param[in]  xpos: position of x
    \param[in]  ypos: position of y
    \param[in]  c: a pointer to the character
    \param[out] none
    \retval     none
*/
void lcd_vertical_char_draw(uint16_t xpos, uint16_t ypos, const uint16_t *c)
{
    uint32_t index = 0, counter = 0;

    for(index = 0; index < current_font->height; index++) {
        for(counter = 0; counter < current_font->width; counter++) {
            if((((c[index] & ((0x80 << ((current_font->width / 12) * 8)) >> counter)) == 0x00) && (current_font->width <= 12)) ||
                    (((c[index] & (0x1 << counter)) == 0x00) && (current_font->width > 12))) {
            } else {
                pixel_set(xpos + index, ypos + current_font->width - counter);
            }
        }
    }
}

/*!
    \brief      set a pixel
    \param[in]  x: x position
    \param[in]  y: y position
    \param[out] none
    \retval     none
*/
static void pixel_set(int16_t x, int16_t y)
{
    if(x < 0 || x > (LCD_PIXEL_WIDTH - 1) || y < 0 || y > (LCD_PIXEL_HEIGHT - 1)) {
        return;
    }

    /* draw pixel with current text color */
    *(__IO uint16_t *)(current_framebuffer + 2 * ((LCD_PIXEL_WIDTH * y) + x)) = current_textcolor;
}
